In [52]:
import numpy as np
import pandas as pd

In [53]:
data_one = {'A': ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3']}
data_two = {'C': ['C0','C1','C2','C3'], 'D': ['D0','D1','D2','D3']}
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [54]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [55]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [56]:
pd.concat([one,two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [57]:
pd.concat([one,two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [58]:
two.columns = one.columns
mydf = pd.concat([one,two],axis=0)
mydf.index = range(len(mydf)) # izgenerira index da bude unique
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [59]:
# inner merge
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [60]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [61]:
pd.merge(registrations,logins, how='inner', on='name') # nije bitno da li registration ili logins prvo navedec, kod ostalih je bitno

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [62]:
pd.merge(left=registrations,right=logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [63]:
pd.merge(left=registrations,right=logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [64]:
pd.merge(left=registrations,right=logins, how='outer', on='name') # sve skupa se objedini, nije bitno ko je left a ko right

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [65]:
registrations=registrations.set_index('name')
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [66]:
pd.merge(left=registrations,right=logins,how='inner',left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [67]:
registrations=registrations.reset_index()
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [69]:
registrations.columns = ['reg_name','reg_id']
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [71]:
result=pd.merge(left=registrations,right=logins,how='inner',left_on='reg_name',right_on='name')
result

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [79]:
result=result.drop('reg_name',axis=1)
result

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [80]:
registrations.columns = ['name','id']
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [81]:
logins.columns = ['id','name']
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [82]:
pd.merge(registrations,logins,how='inner',on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [84]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_r','_l'))

     name  id_r  id_l
0  Andrew     1     2
1    Bobo     2     4